

. ## read data
Unknown #command
. use hersdata.dta

. drop if diabetes ==1   // 731 obs deleted
(731 observations deleted)

. drop if mi(HDL) | mi(BMI) | mi(age) | mi(drinkany) // 11 obs deleted
(11 observations deleted)

. keep HDL BMI age drinkany

. 
. ## Part A) = bootstrap "by hand"
Unknown #command
. ## =============================
Unknown #command
. 
. ## Writing our own bootstrap program requires four steps.
Unknown #command
. ## 
Unknown #command
. ## 1) In the first step we obtain initial estimates and store the results in a matrix, 
Unknown #command
. ## say observe. In addition, we must also note the number of observations used in the analysis. 
Unknown #command
. ## This information will be used when we summarize the bootstrap results.
Unknown #command
. ## 
Unknown #command
. ## 2) Second, we write a program which we will call myboot that samples the 
Unknown #command
. ## data with replacement and returns the statistic of interest. In this step, 
Unknown #command
. ## we start by preserving the data with the preserve command, then take a bootstrap
Unknown #command
. ## sample with bsample. bsample samples the data in memory with replacement,
Unknown #command
. ## which is the essential element of the bootstrap. From the bootstrap sample 
Unknown #command
. ## we run our regression model and output the statistic of interest with the return 
Unknown #command
. ## scalar command. Note that when we define the program, program define myboot, 
Unknown #command
. ## we specify the rclass option; without that option, we would not be able to output 
Unknown #command
. ## the bootstrapped statistic. myboot concludes with the restore command, 
Unknown #command
. ## which returns the data to the original state (prior to the bootstrapped sample).
Unknown #command
. ## 
Unknown #command
. ## 3) In the third step, we use the simulate prefix command along with myboot, 
Unknown #command
. ## which collects the statistic from the bootstrapped sample. 
Unknown #command
. ## We specify the seed and number of replications at this step, which coincide 
Unknown #command
. ## with those from the example above.
Unknown #command
. ## 
Unknown #command
. ## 4) Finally, we use the bstat command to summarize the results. 
Unknown #command
. ## We include the initial estimates, stored in the matrix observe, and the 
Unknown #command
. ## sample size with the stat( ) and n() options, respectively.
Unknown #command
.  
.  
.  
. ## Step 1 - define model and store the coefficients via the observe command
Unknown #command
. regress HDL BMI age drinkany 

      Source |       SS           df       MS      Number of obs   =     2,021
-------------+----------------------------------   F(3, 2017)      =     46.91
       Model |  24006.0684         3  8002.02279   Prob > F        =    0.0000
    Residual |  344071.218     2,017  170.585631   R-squared       =    0.0652
-------------+----------------------------------   Adj R-squared   =    0.0638
       Total |  368077.286     2,020  182.216478   Root MSE        =    13.061

------------------------------------------------------------------------------
         HDL | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.4036859   .0571063    -7.07   0.000    -.5156793   -.2916924
         age |   .2086808   .0437416     4.77   0.000     .1228974    .2944643
    drinkany |   4.502504   .5880671     7.66   0.000     3.349222    5.655787
       _cons |   46.68225   3.571831    13.07   0.000     39.67739    53.68712
------------------------------------------------------------------------------

. 
. matrix observe= (_b[_cons], _b[BMI], _b[age], _b[drinkany])

. matrix list observe

observe[1,4]
            c1          c2          c3          c4
r1   46.682253  -.40368587   .20868084   4.5025044

. 
.  
. ## Step 2 - program to be repeated
Unknown #command
. capture program drop myboot2

. program define myboot2, rclass
  1.  preserve 
  2.   bsample
  3.     regress HDL BMI age drinkany  
  4.     ## fit model, store coeff 
Unknown #command
.           return scalar b0 = _b[_cons]
  5.     return scalar b1 = _b[BMI]
  6.     return scalar b2 = _b[age]
  7.         return scalar b3 = _b[drinkany]
  8.  restore
  9. end

. 
. ## Step 3 - simulation = resampling the data using the program myboot2, R=1000 replicates
Unknown #command
. simulate  b0=r(b0) b1=r(b1) b2=r(b2) b3=r(b3), reps(1000) seed(12345): myboot2

      Command: myboot2
           b0: r(b0)
           b1: r(b1)
           b2: r(b2)
           b3: r(b3)

Simulations (1,000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
.................................................. 1,000

. 
. ## Step 4 - compute 95% CIs
Unknown #command
. bstat, stat(observe) n(2021) 

Bootstrap results                                        Number of obs = 2,021
                                                         Replications  = 1,000

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          b0 |   46.68225   3.455292    13.51   0.000     39.91001     53.4545
          b1 |  -.4036859   .0548886    -7.35   0.000    -.5112656   -.2961062
          b2 |   .2086808   .0430616     4.85   0.000     .1242817      .29308
          b3 |   4.502504   .5957828     7.56   0.000     3.334792    5.670217
------------------------------------------------------------------------------

.                     ## n = nb of observations --> CAUTION HERE
Unknown #command
. estat bootstrap, all

Bootstrap results                               Number of obs     =      2,021
                                                Replications      =       1000

------------------------------------------------------------------------------
             |    Observed               Bootstrap
             | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
          b0 |   46.682253   .1759177   3.4552918    39.91001    53.4545   (N)
             |                                       40.42489   54.07221   (P)
             |                                       39.84275   53.29212  (BC)
          b1 |  -.40368587  -.0038854    .0548886   -.5112656  -.2961062   (N)
             |                                      -.5188768  -.2992493   (P)
             |                                       -.507547  -.2924751  (BC)
          b2 |   .20868084  -.0009771   .04306157    .1242817     .29308   (N)
             |                                        .117856   .2910675   (P)
             |                                       .1173203   .2900742  (BC)
          b3 |   4.5025044   .0024019   .59578279    3.334792   5.670217   (N)
             |                                       3.368253   5.692966   (P)
             |                                       3.405528   5.748656  (BC)
------------------------------------------------------------------------------
Key:  N: Normal
      P: Percentile
     BC: Bias-corrected

. 
. ## NB: you can reduce the output of estat bootstrap by specifying 
Unknown #command
. ## the option (e.g. percentile) instead of all 
Unknown #command
. 
. estat bootstrap, percentile

Bootstrap results                               Number of obs     =      2,021
                                                Replications      =       1000

------------------------------------------------------------------------------
             |    Observed               Bootstrap
             | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
          b0 |   46.682253   .1759177   3.4552918    40.42489   54.07221   (P)
          b1 |  -.40368587  -.0038854    .0548886   -.5188768  -.2992493   (P)
          b2 |   .20868084  -.0009771   .04306157     .117856   .2910675   (P)
          b3 |   4.5025044   .0024019   .59578279    3.368253   5.692966   (P)
------------------------------------------------------------------------------
Key: P: Percentile

. 
. 
. ## NB: you can change the number of replicates i.e. the argument of reps()
Unknown #command
. ##     we need at least 1000 replicates for 95% CU
Unknown #command
. ##     The seed use here is only there to replicate the simulations
Unknown #command
. ##     if you don't specify a seed, a random seed will be chosen and different results
Unknown #command
. ##     will be obtained each time (very similar though). The difference is due to the
Unknown #command
. ##     Monte Carlo variability.
Unknown #command
. 
. 
. 
. ##  select the code above and run
Unknown #command
. 
. ## NB: browse the active dataset, the dimension and the columns. NO LONGER hers
Unknown #command
. 
. desc

Contains data
 Observations:         1,000                  simulate: myboot2
    Variables:             4                  24 Apr 2025 09:21
-------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------
b0              float   %9.0g                 r(b0)
b1              float   %9.0g                 r(b1)
b2              float   %9.0g                 r(b2)
b3              float   %9.0g                 r(b3)
-------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. list if _n<20 

      +--------------------------------------------+
      |       b0          b1         b2         b3 |
      |--------------------------------------------|
   1. |  55.0277    -.507547   .1273913   4.579051 |
   2. | 43.05033   -.3214125   .2198346    4.56848 |
   3. | 41.79856   -.3580904   .2595156   4.108671 |
   4. | 47.37144   -.3629469   .1825078   4.238028 |
   5. | 45.83468   -.3676654   .2150579   3.279417 |
      |--------------------------------------------|
   6. | 43.68774   -.4242001   .2591675   4.742793 |
   7. | 46.68452   -.4392134   .2143669   5.071074 |
   8. | 46.22334   -.3971224   .2033755   5.373112 |
   9. | 45.68821   -.4942878   .2594136   4.191213 |
  10. |  45.2424   -.3911622   .2145017   5.476406 |
      |--------------------------------------------|
  11. |  48.1397   -.3311509   .1490672   5.302119 |
  12. | 50.02382    -.433796   .1687294   5.122212 |
  13. | 41.93714   -.3431965   .2403703   5.655903 |
  14. | 43.53362   -.3849073   .2465488   4.113903 |
  15. |   45.835    -.441162   .2361516   4.045438 |
      |--------------------------------------------|
  16. | 46.65306   -.4823789   .2538138   3.141874 |
  17. | 44.25373   -.3605336   .2135229   5.084305 |
  18. | 49.38696   -.4354429   .1772449   5.243911 |
  19. | 44.58269   -.4229109   .2491518   4.564682 |
      +--------------------------------------------+

. 
. 
. #  percentile CI for each coefficient & histogram
Unknown #command
. #  ------------------------------------------------
Unknown #command
. 
. ## write a one line command for the histogram and another line for the percentile CI (per coefficient)
Unknown #command
. 
.  
. ##  4) boostrap  using the libary boot - use Part B below
Unknown #command
.  
. 
. # Part B) use a Stata command - SIMPLER
Unknown #command
. # ======================================
Unknown #command
. 
.  
. clear

. ## read the dataset again
Unknown #command
.  
. use hersdata.dta

. drop if diabetes ==1  
(731 observations deleted)

. drop if mi(HDL) | mi(BMI) | mi(age) | mi(drinkany) 
(11 observations deleted)

. keep HDL BMI age drinkany

. 
. bootstrap, reps(1000)  seed(12345): regress HDL BMI age drinkany  
(running regress on estimation sample)

Bootstrap replications (1,000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
.................................................. 1,000

Linear regression                                      Number of obs =   2,021
                                                       Replications  =   1,000
                                                       Wald chi2(3)  =  122.77
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0652
                                                       Adj R-squared =  0.0638
                                                       Root MSE      = 13.0608

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
         HDL | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.4036859   .0548886    -7.35   0.000    -.5112656   -.2961062
         age |   .2086808   .0430616     4.85   0.000     .1242817      .29308
    drinkany |   4.502504   .5957828     7.56   0.000     3.334792    5.670217
       _cons |   46.68225   3.455292    13.51   0.000     39.91001     53.4545
------------------------------------------------------------------------------

. estat bootstrap, all        

Linear regression                               Number of obs     =      2,021
                                                Replications      =       1000

------------------------------------------------------------------------------
             |    Observed               Bootstrap
         HDL | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.40368587  -.0038854    .0548886   -.5112656  -.2961062   (N)
             |                                      -.5188768  -.2992493   (P)
             |                                       -.507547  -.2924751  (BC)
         age |   .20868084  -.0009771   .04306157    .1242817     .29308   (N)
             |                                        .117856   .2910675   (P)
             |                                       .1173203   .2900742  (BC)
    drinkany |   4.5025044   .0024019   .59578279    3.334792   5.670217   (N)
             |                                       3.368253   5.692966   (P)
             |                                       3.405528   5.748656  (BC)
       _cons |   46.682253   .1759177   3.4552918    39.91001    53.4545   (N)
             |                                       40.42489   54.07221   (P)
             |                                       39.84275   53.29212  (BC)
------------------------------------------------------------------------------
Key:  N: Normal
      P: Percentile
     BC: Bias-corrected

. ## all 3 types
Unknown #command
. 
. bootstrap, reps(1000)  seed(12345): regress HDL BMI age drinkany 
(running regress on estimation sample)

Bootstrap replications (1,000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
.................................................. 1,000

Linear regression                                      Number of obs =   2,021
                                                       Replications  =   1,000
                                                       Wald chi2(3)  =  122.77
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0652
                                                       Adj R-squared =  0.0638
                                                       Root MSE      = 13.0608

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
         HDL | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.4036859   .0548886    -7.35   0.000    -.5112656   -.2961062
         age |   .2086808   .0430616     4.85   0.000     .1242817      .29308
    drinkany |   4.502504   .5957828     7.56   0.000     3.334792    5.670217
       _cons |   46.68225   3.455292    13.51   0.000     39.91001     53.4545
------------------------------------------------------------------------------

. estat bootstrap, percentile 

Linear regression                               Number of obs     =      2,021
                                                Replications      =       1000

------------------------------------------------------------------------------
             |    Observed               Bootstrap
         HDL | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.40368587  -.0038854    .0548886   -.5188768  -.2992493   (P)
         age |   .20868084  -.0009771   .04306157     .117856   .2910675   (P)
    drinkany |   4.5025044   .0024019   .59578279    3.368253   5.692966   (P)
       _cons |   46.682253   .1759177   3.4552918    40.42489   54.07221   (P)
------------------------------------------------------------------------------
Key: P: Percentile

. ## percentile
Unknown #command
. 
. bootstrap, reps(1000)  seed(12345): regress HDL BMI age drinkany 
(running regress on estimation sample)

Bootstrap replications (1,000)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
.................................................. 1,000

Linear regression                                      Number of obs =   2,021
                                                       Replications  =   1,000
                                                       Wald chi2(3)  =  122.77
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0652
                                                       Adj R-squared =  0.0638
                                                       Root MSE      = 13.0608

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
         HDL | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.4036859   .0548886    -7.35   0.000    -.5112656   -.2961062
         age |   .2086808   .0430616     4.85   0.000     .1242817      .29308
    drinkany |   4.502504   .5957828     7.56   0.000     3.334792    5.670217
       _cons |   46.68225   3.455292    13.51   0.000     39.91001     53.4545
------------------------------------------------------------------------------

. estat bootstrap, normal     

Linear regression                               Number of obs     =      2,021
                                                Replications      =       1000

------------------------------------------------------------------------------
             |    Observed               Bootstrap
         HDL | coefficient       Bias    std. err.  [95% conf. interval]
-------------+----------------------------------------------------------------
         BMI |  -.40368587  -.0038854    .0548886   -.5112656  -.2961062   (N)
         age |   .20868084  -.0009771   .04306157    .1242817     .29308   (N)
    drinkany |   4.5025044   .0024019   .59578279    3.334792   5.670217   (N)
       _cons |   46.682253   .1759177   3.4552918    39.91001    53.4545   (N)
------------------------------------------------------------------------------
Key: N: Normal

. ## normal
Unknown #command
. 
. ## to get the BCa option alone, type this
Unknown #command
. bootstrap, bca reps(1000)  seed(12345): regress HDL BMI age drinkany  
(running regress on estimation sample)

Jackknife replications (2,021)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
..................................................   500
..................................................   550
..................................................   600
..................................................   650
..................................................   700
..................................................   750
..................................................   800
..................................................   850
..................................................   900
..................................................   950
.................................................. 1,000
.................................................. 1,050
.................................................. 1,100
.................................................. 1,150
.................................................. 1,200
.................................................. 1,250
.................................................. 1,300
.................................................. 1,350
